import { DataList } from 'types/types';

export const data: DataList[] = [
  {
    id: '0',
    title: 'Технологии',
    startYear: '1980',
    endYear: '1986',

    list: [
      {
        id: '0',
        date: '1980',
        text: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        id: '1',
        date: '1982',
        text: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        id: '2',
        date: '1980',
        text: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        id: '3',
        date: '1980',
        text: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        id: '4',
        date: '1980',
        text: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
    ],
  },
  {
    id: '1',
    title: 'Кино',
    startYear: '1987',
    endYear: '1991',

    list: [
      {
        id: '0',
        date: '1987',
        text: '«Хищник»/Predator, США (реж. Джон Мактирнан)',
      },
      {
        id: '1',
        date: '1988',
        text: '«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)',
      },
      {
        id: '2',
        date: '1989',
        text: '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)',
      },
      {
        id: '3',
        date: '1990',
        text: '«Крепкий орешек»/Die Hard 2, США (реж. Ренни Харлин)',
      },
      {
        id: '4',
        date: '1991',
        text: '«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)',
      },
    ],
  },
  {
    id: '2',
    title: 'Литература',
    startYear: '1992',
    endYear: '1997',

    list: [
      {
        id: '0',
        date: '1992',
        text: 'Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах.»',
      },
      {
        id: '1',
        date: '1994',
        text: '«Бессоница» - Стивена Кинга.',
      },
      {
        id: '2',
        date: '1989',
        text: '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)',
      },
      {
        id: '3',
        date: '1990',
        text: '«Крепкий орешек»/Die Hard 2, США (реж. Ренни Харлин)',
      },
      {
        id: '4',
        date: '1991',
        text: '«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)',
      },
    ],
  },
  {
    id: '3',
    title: 'Искусство',
    startYear: '1999',
    endYear: '2004',

    list: [
      {
        id: '0',
        date: '1999',
        text: 'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пильона',
      },
      {
        id: '1',
        date: '2000',
        text: 'Возобновление издание журнала «Театр».',
      },
      {
        id: '2',
        date: '2002',
        text: 'Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.',
      },
    ],
  },
  {
    id: '4',
    title: 'Спорт',
    startYear: '2006',
    endYear: '2014',

    list: [
      {
        id: '0',
        date: '2006',
        text: 'Баскетбольный клуб ЦСКА стал победителем национального первенства России.',
      },
      {
        id: '1',
        date: '2008',
        text: 'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры.',
      },
      {
        id: '2',
        date: '2012',
        text: '2 августа - Летние Олимпийские игры.',
      },
      {
        id: '3',
        date: '2014',
        text: 'XXII зимние Олимпийские игры (Сочи, Россия).',
      },
    ],
  },
  {
    id: '5',
    title: 'Наука',
    startYear: '2015',
    endYear: '2022',

    list: [
      {
        id: '0',
        date: '2015',
        text: '13 сентября - частное солнечное затмение, видимое в Южной Африке и части Антарктиды.',
      },
      {
        id: '1',
        date: '2016',
        text: 'телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик получившую обозначение GN-z11.',
      },
      {
        id: '2',
        date: '2017',
        text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.',
      },
      {
        id: '3',
        date: '2020',
        text: 'Корабль Crew Dragon вернулся на Землю из первого пилотного полета.',
      },
    ],
  },
];
